#### Terraform working directory 🏠: `demo/demo-account/demo-application/elb`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.lb_instances.module.lb["alb-test"].aws_lb_target_group_attachment.this["tst-ath-0"] must be replaced
-/+ resource "aws_lb_target_group_attachment" "this" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/8287827573ffa184-20231201041106584000000001" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/8287827573ffa184" # forces replacement -> (known after apply) # forces replacement
      ~ target_id        = "172.18.76.62" -> "ap-southeast-1" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_listener.frontend_http_tcp["8080"] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:listener/app/alb-test/2b4a244772ef3756/02d97a322d114ec7"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/8287827573ffa184" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_target_group.main["prdapp"] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/8287827573ffa184" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/prdapp/8287827573ffa184" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/8287827573ffa184" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "prdapp"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "prdapp"
        }
      ~ target_type                        = "ip" -> "instance" # forces replacement
        # (8 unchanged attributes hidden)

      - target_failover {}

      - target_health_state {}

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
